In [1]:
import pandas as pd

In [3]:
file=pd.read_excel(r"C:\Users\mani\OneDrive\Desktop\Python files\file_data.xlsx")

In [4]:
file

    firstname middlename  lastname
0  Aishwariya        Rai  Bachchan
1    Priyanka     Chopra     Jonas
2       Tammy     Donald    Reuben
3       Ankit        NaN     Yadav
4      Shilpa        NaN       NaN

In [16]:
file['fullname']=file[['firstname','middlename','lastname']].apply(lambda x: ' '.join(x),axis=1)
file

    firstname middlename  lastname                 fullname
0  Aishwariya        Rai  Bachchan  Aishwariya Rai Bachchan
1    Priyanka     Chopra     Jonas    Priyanka Chopra Jonas
2       Tammy     Donald    Reuben      Tammy Donald Reuben
3       Ankit        nan     Yadav          Ankit nan Yadav
4      Shilpa        nan       nan           Shilpa nan nan

In [17]:
file

    firstname middlename  lastname                 fullname
0  Aishwariya        Rai  Bachchan  Aishwariya Rai Bachchan
1    Priyanka     Chopra     Jonas    Priyanka Chopra Jonas
2       Tammy     Donald    Reuben      Tammy Donald Reuben
3       Ankit        nan     Yadav          Ankit nan Yadav
4      Shilpa        nan       nan           Shilpa nan nan

In [18]:
file1=file.copy()

In [19]:
file1

    firstname middlename  lastname                 fullname
0  Aishwariya        Rai  Bachchan  Aishwariya Rai Bachchan
1    Priyanka     Chopra     Jonas    Priyanka Chopra Jonas
2       Tammy     Donald    Reuben      Tammy Donald Reuben
3       Ankit        nan     Yadav          Ankit nan Yadav
4      Shilpa        nan       nan           Shilpa nan nan